In [1]:
import pandas as pd
import numpy as np

In [4]:
obje=pd.Series(range(5),index=["a","b","c","d","e"])

In [6]:
obje

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [8]:
obje["c"]

2

In [9]:
obje[2]

2

In [11]:
obje[0:3]

a    0
b    1
c    2
dtype: int64

In [12]:
obje[["a","c"]]

a    0
c    2
dtype: int64

In [13]:
obje[[0,2]]

a    0
c    2
dtype: int64

In [14]:
obje[obje<2]

a    0
b    1
dtype: int64

In [15]:
obje["a":"c"]

a    0
b    1
c    2
dtype: int64

In [16]:
obje["b":"c"]=5

In [17]:
obje

a    0
b    5
c    5
d    3
e    4
dtype: int64

In [23]:
veri=pd.DataFrame(np.arange(25).reshape(5,5),index=["Bursa","Ankara","Rize","İstanbul","Konya"],columns=["bir","iki","üç","dört","beş"])

In [21]:
veri

          bir  iki  üç  dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [24]:
veri.head(7)

          bir  iki  üç  dört  beş
Bursa       0    1   2     3    4
Ankara      5    6   7     8    9
Rize       10   11  12    13   14
İstanbul   15   16  17    18   19
Konya      20   21  22    23   24

In [25]:
    veri["iki"]

Bursa        1
Ankara       6
Rize        11
İstanbul    16
Konya       21
Name: iki, dtype: int32

In [26]:
veri[["bir","iki"]]

          bir  iki
Bursa       0    1
Ankara      5    6
Rize       10   11
İstanbul   15   16
Konya      20   21

In [27]:
veri[:3]

        bir  iki  üç  dört  beş
Bursa     0    1   2     3    4
Ankara    5    6   7     8    9
Rize     10   11  12    13   14

In [45]:
veri

          bir  iki  üç  dört  beş
Bursa       0    0   0     0    0
Ankara      5    6   7     8    9
Rize       10   11  12    13   14
İstanbul   15   16  17    18   19
Konya      20   21  22    23   24

In [44]:
veri

          bir  iki  üç  dört  beş
Bursa       0    0   0     0    0
Ankara      5    6   7     8    9
Rize       10   11  12    13   14
İstanbul   15   16  17    18   19
Konya      20   21  22    23   24

In [31]:
veri

          bir  iki  üç  dört  beş
Bursa       0    0   0     0    0
Ankara      5    6   7     8    9
Rize       10   11  12    13   14
İstanbul   15   16  17    18   19
Konya      20   21  22    23   24

In [32]:
veri.iloc[1]

bir     5
iki     6
üç      7
dört    8
beş     9
Name: Ankara, dtype: int32

In [35]:
veri.iloc[1,[0,1,2,3]]

bir     5
iki     6
üç      7
dört    8
Name: Ankara, dtype: int32

In [37]:
veri.iloc[[1,3],[1,2,3]]

          iki  üç  dört
Ankara      6   7     8
İstanbul   16  17    18

In [40]:
veri.loc["Ankara"]

bir     5
iki     6
üç      7
dört    8
beş     9
Name: Ankara, dtype: int32

In [41]:
veri.loc["Rize",["bir","iki"]]

bir    10
iki    11
Name: Rize, dtype: int32

In [42]:
veri.loc[:"Rize","dört"]

Bursa      0
Ankara     8
Rize      13
Name: dört, dtype: int32

In [43]:
veri

          bir  iki  üç  dört  beş
Bursa       0    0   0     0    0
Ankara      5    6   7     8    9
Rize       10   11  12    13   14
İstanbul   15   16  17    18   19
Konya      20   21  22    23   24

In [50]:
veri=pd.DataFrame(np.arange(16).reshape(4,4),index=["Bursa","Ankara","Rize","İstanbul"],columns=["bir","iki","üç","dört"])

In [51]:
veri

          bir  iki  üç  dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [48]:
veri.loc[:"Rize","dört"]

Bursa      3
Ankara     8
Rize      13
Name: dört, dtype: int32